In [20]:
import sqlite3
import pandas as pd

In [2]:
query="""
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""

In [3]:
con = sqlite3.connect('mydata.sqlite')

In [4]:
con.execute(query)

In [6]:
con.commit()

In [10]:
data=[('Atlanta','Georgia',1.25,6),
     ('Tallahassee','Florida',2.6,3),
     ('Sacramento', 'California', 1.7, 5)]

In [11]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [13]:
con.executemany(stmt, data)

In [14]:
con.commit()

In [24]:
cursor=con.execute('select * from test')

In [25]:
rows=cursor.fetchall()

In [26]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [27]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [29]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [30]:
import sqlalchemy as sqla

In [32]:
db=sqla.create_engine('sqlite:///mydata.sqlite')

In [33]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5